tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "teamookla/speedtest"
tap "zero-sh/tap"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Make creating custom firmwares for ESP32/ESP8266 super easy
brew "esphome"
# Command-line fuzzy finder written in Go
brew "fzf"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared", link: false
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Application launcher and productivity software
cask "alfred"
# Menu bar icon organizer
cask "bartender"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Voice and text chat software
cask "discord"
# Application window manager focusing on simplicity
cask "divvy"
# Tool to measure the computer system's performance
cask "geekbench"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your Sonos system
cask "sonos"
# Video game digital distribution service
cask "steam"
# Customize mouse buttons, wheels and cursor speed
cask "steermouse"
# Open-source code editor
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "Brother P-touch Editor", id: 1453365242
mas "Craft", id: 1487937127
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Menu Bar Controller for Sonos", id: 1357379892
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SponsorBlock for YouTube - Skip Sponsorships", id: 1573461917
mas "Telegram", id: 747648890
mas "Things", id: 904280696
mas "Wipr", id: 1320666476
