tap "1password/tap"
tap "cloudflare/cloudflare"
tap "cue-lang/tap"
tap "fluxcd/tap"
tap "go-task/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homeport/tap"
tap "jakehilborn/jakehilborn"
tap "johanhaleby/kubetail"
tap "kluctl/tap"
tap "kodek/tap"
tap "koekeishiya/formulae"
tap "pulumi/tap"
tap "raffis/gitops-zombies"
tap "romkatv/powerlevel10k"
tap "siderolabs/talos"
tap "sidneys/homebrew"
tap "smudge/smudge"
tap "teamookla/speedtest"
tap "weaveworks/tap"
tap "zero-sh/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Linter for YAML files
brew "yamllint"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Download with resuming and segmented downloading
brew "aria2"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Extract files from Microsoft cabinet files
brew "cabextract"
# XML-based font configuration API for X Windows
brew "fontconfig"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Load/unload environment variables based on $PWD
brew "direnv"
# Run arbitrary commands when files change
brew "entr"
# Pretty-print tabular data in Python
brew "python-tabulate"
# Make creating custom firmwares for ESP32/ESP8266 super easy
brew "esphome"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Kubernetes package manager
brew "helm"
# Converts many CD-ROM image formats to ISO9660
brew "iat"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Utility to create k3s clusters on any local or remote VM
brew "k3sup"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kotlin Language Interactive Shell
brew "ki"
# Run local Kubernetes cluster in Docker
brew "kind"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Statically typed programming language for the JVM
brew "kotlin"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Validate Kubernetes configuration files, supports multiple Kubernetes versions
brew "kubeval"
# Application Platform based on Kubernetes and Open Application Model
brew "kubevela"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Run LogQL queries against a Loki server
brew "logcli"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Automated testing for Ansible roles
brew "molecule", link: false
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Platform built on V8 to build network applications
brew "node"
# Professional collaborative platform for embedded development
brew "platformio"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier", link: false
# Show ps output as a tree
brew "pstree"
# Safe, concurrent, practical language
brew "rust"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# CLI tool for termius.com (aka serverauditor.com)
brew "termius"
# Tool to build, change, and version infrastructure
brew "terraform"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Additional completion definitions for zsh
brew "zsh-completions"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# Cloudflare Warp
brew "cloudflare/cloudflare/warp"
# CUE is an open source data constraint language which aims to simplify tasks involving defining and using data.
brew "cue-lang/tap/cue"
# Flux CLI
brew "fluxcd/tap/flux"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "homeport/tap/dyff"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail", args: ["with-short-names"]
# kluctl
brew "kluctl/tap/kluctl"
# MiniDSP Controller
brew "kodek/tap/minidsp-rs"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# A tool to convert Terraform projects to Pulumi programs
brew "pulumi/tap/tf2pulumi"
# Identify kubernetes resources which are not managed by GitOps
brew "raffis/gitops-zombies/gitops-zombies"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Offline NT Password Editor
brew "sidneys/homebrew/chntpw"
# A CLI for configuring 'Night Shift' on macOS 🌕🌖🌗🌘🌑
brew "smudge/smudge/nightlight"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# GitOps support for Kubernetes
brew "weaveworks/tap/gitops"
# Open source color effects manager for Razer devices
cask "1kc-razer"
# Password manager that keeps all passwords secure behind one password
cask "1password-beta"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Electronics prototyping platform
cask "arduino"
# Aria2 GUI
cask "aria2d"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organizer
cask "bartender"
# Utility to scan for iBeacon-compatible devices
cask "beacon-scanner"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Bluetooth Low Energy browser
cask "bluetility"
# GUI app for Homebrew
cask "cakebrew"
# Collect, organize, edit and annotate documents
cask "devonthink"
# Voice and text chat software
cask "discord"
cask "displaycal"
# Application window manager focusing on simplicity
cask "divvy"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to measure the computer system's performance
cask "geekbench"
# Desktop client for GitHub repositories
cask "github"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Java IDE by JetBrains
cask "intellij-idea"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Remote development gateway by Jetbrains
cask "jetbrains-gateway"
# Keyboard customizer
cask "karabiner-elements"
# Free and open-source painting and sketching program
cask "krita"
# Kubernetes IDE
cask "lens"
# Personal productivity app
cask "marvin"
# GameStream client
cask "moonlight"
cask "mqtt-explorer"
# Database administration and development tool for SQLite
cask "navicat-for-sqlite"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open source build of Lens Kubernetes IDE
cask "openlens"
# Extract files and folders from package files, disk images, and archives
cask "pacifist"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# View, Screen Share, organize, import, and download files to a reMarkable device
cask "remarkable"
# Music player
cask "roon"
# Control your Sonos system
cask "sonos"
# Notepad with a built-in calculator
cask "soulver"
# Video game digital distribution service
cask "steam"
# Customize mouse buttons, wheels and cursor speed
cask "steermouse"
# Terminal emulator, SSH and serial client
cask "tabby"
# CLI for out-of-band management of Kubernetes nodes created by Talos
cask "talosctl"
# Cluster management UI which relies on local ~/.talos/config and provides OS level hooks by connecting to Talos gRPC API. Then Kubernetes credentials are requested from the Talos API
cask "theila"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Open-source code editor
cask "visual-studio-code"
# Resources for Wacom tablets
cask "wacom-tablet"
# Rust-based terminal
cask "warp"
# Workspace organizing app
cask "workspaces"
# Mindmap and brainstorming app
cask "xmind-zen"
# Handwriting notetaking software
cask "xournal-plus-plus"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer", id: 824171161
mas "Auth for Tesla", id: 1552058613
mas "Brother P-touch Editor", id: 1453365242
mas "Calca", id: 635758264
mas "Craft", id: 1487937127
mas "Crossy Castle", id: 1489275350
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Menu Bar Controller for Sonos", id: 1357379892
mas "Microsoft Remote Desktop", id: 1295203466
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Session", id: 1521432881
mas "SponsorBlock for YouTube - Skip Sponsorships", id: 1573461917
mas "Telegram", id: 747648890
mas "Things", id: 904280696
mas "Turn Off the Lights for Safari", id: 1273998507
mas "Wipr", id: 1320666476
